#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/eggs-projects/infra/runs/run-PXpRqUPRJQvYfqbi

Waiting for the plan to start...

Terraform v1.1.8
on linux_amd64
Initializing plugins and modules...
tfe_workspace.projects["blog"]: Refreshing state... [id=ws-yF7cX2wrjPJLKDwz]
github_repository.projects["blog"]: Refreshing state... [id=blog]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.tf_api_token["blog"] will be created
  + resource "github_actions_secret" "tf_api_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "blog"
      + secret_name     = "TF_API_TOKEN"
      + updated_at      = (known after apply)
    }

  # tfe_workspace.projects["blog"] will be updated in-place
  ~ resource "tfe_workspace" "projects" {
        id                            = "ws-yF7cX2wrjPJLKDwz"
      ~ name                          = "blog" -> "eggs-projects-blog"
        # (17 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @michaeldeggers, Action: `pull_request`*